import AppFeatures from "@/app/_widgets/appFeatures";
import Contact from "@/app/_widgets/contact";
import EventsTillNow from "@/app/_widgets/eventsTillNow";
import FAQ from "@/app/_widgets/faq";
import ManageFiles from "@/app/_widgets/managaFiles";
import QuoteFromUsers from "@/app/_widgets/quoteFromUsers";
import SecondPocket from "@/app/_widgets/secondPocket";
import { Qoute } from "@/app/globalTypes";
import { Fragment } from "react";

export default function Home() {
  const quotes: Qoute[] = [
    {
      userName: "میلاد آزموده",
      subtitle: "کارشناس ارشد املاک در آژانس مسکن نوین",
      userQuote:
        "مهمترین مزیت استفاده از پست ملک برای من، جمع شدن همه فایل‌هام تو یه بستر آنلاین بود. خوشبختانه کار با سامانه هم راحت بود و بعد یه بار استفاده تقریبا یاد گرفتمش. نکته مهم دیگه برای من این بود که پست ملک روی گوشی خیلی خوب کار می‌کنه و اطلاعات رو خیلی جالب دسته‌بندی می‌کنه و نمایش میده. من از پست ملک برای تنظیم قراردادهای فروش و اجاره هم استفاده می‌کنم.",
    },
    {
      userName: "سارا موحد",
      subtitle: "کارشناس ارشد املاک در گروه مشاورین خانه تو",
      userQuote:
        "”با معرفی یکی از همکارام با پست ملک آشنا شدم و الان برای تنظیم قراردادها و صدور فاکتور مشتری فقط از پست ملک استفاده می‌کنم. همیشه برای تنظیم قراردادها مشکل داشتم؛ خوشبختانه با پست ملک خیلی راحت و فقط با وارد کردن اطلاعات کلی میشه یه قرارداد خیلی خوب و حرفه‌ای تنظیم کرد. ضمن اینکه میشه بعد از محاسبه خودکار پورسانت، فاکتور مشتری رو هم صادر کرد.",
    },
    {
      userName: "حسن میکائیل‌زاده",
      subtitle: "مدیر گروه مشاورین مسکن راوی",
      userQuote:
        "بعد از دوهفته کار کردن با سامانه پست ملک؛ به تمام کارشناس‌ها گفتم اطلاعات فایل‌هاشون رو تو این سامانه وارد کنن. الان بیش از سه ماهه که کل فایل‌ها فروش و اجاره رو تو سامانه پست ملک وارد کردیم. الان دقیقا می‌دونم کدوم کارشناس رو چه فایلی کار می‌کنه و وضعیت فایل‌ها چطوره. ضمن اینکه خیلی چیزها رو دیگه می‌تونم از خونه و تو وقت‌های آزادم با گوشی چک کنم.",
    },
    {
      userName: "میلاد آزموده",
      subtitle: "کارشناس ارشد املاک در آژانس مسکن نوین",
      userQuote:
        "مهمترین مزیت استفاده از پست ملک برای من، جمع شدن همه فایل‌هام تو یه بستر آنلاین بود. خوشبختانه کار با سامانه هم راحت بود و بعد یه بار استفاده تقریبا یاد گرفتمش. نکته مهم دیگه برای من این بود که پست ملک روی گوشی خیلی خوب کار می‌کنه و اطلاعات رو خیلی جالب دسته‌بندی می‌کنه و نمایش میده. من از پست ملک برای تنظیم قراردادهای فروش و اجاره هم استفاده می‌کنم.",
    },
    {
      userName: "سارا موحد",
      subtitle: "کارشناس ارشد املاک در گروه مشاورین خانه تو",
      userQuote:
        "”با معرفی یکی از همکارام با پست ملک آشنا شدم و الان برای تنظیم قراردادها و صدور فاکتور مشتری فقط از پست ملک استفاده می‌کنم. همیشه برای تنظیم قراردادها مشکل داشتم؛ خوشبختانه با پست ملک خیلی راحت و فقط با وارد کردن اطلاعات کلی میشه یه قرارداد خیلی خوب و حرفه‌ای تنظیم کرد. ضمن اینکه میشه بعد از محاسبه خودکار پورسانت، فاکتور مشتری رو هم صادر کرد.",
    },
    {
      userName: "حسن میکائیل‌زاده",
      subtitle: "مدیر گروه مشاورین مسکن راوی",
      userQuote:
        "بعد از دوهفته کار کردن با سامانه پست ملک؛ به تمام کارشناس‌ها گفتم اطلاعات فایل‌هاشون رو تو این سامانه وارد کنن. الان بیش از سه ماهه که کل فایل‌ها فروش و اجاره رو تو سامانه پست ملک وارد کردیم. الان دقیقا می‌دونم کدوم کارشناس رو چه فایلی کار می‌کنه و وضعیت فایل‌ها چطوره. ضمن اینکه خیلی چیزها رو دیگه می‌تونم از خونه و تو وقت‌های آزادم با گوشی چک کنم.",
    },
  ];

  return (
    <Fragment>
      <SecondPocket />
      <AppFeatures />
      <EventsTillNow />
      <QuoteFromUsers title="تجربه مشاورین مسکن" quotes={quotes} />
      <ManageFiles />
      <FAQ />
      <Contact />
    </Fragment>
  );
}
