import { Fragment } from "react";
import Header from "../_widgets/headerWithSearch";
import MostVisitedCities from "../_widgets/mostVisitedCities";
import QuoteFromUsers from "../_widgets/quoteFromUsers";
import WhyPstMelk from "../_widgets/whyPstMelk";
import Pocket from "../_widgets/pocket";
import SuggestedPages from "../_widgets/suggestedPages";
import Strongest from "../_widgets/strongest";
import FAQ from "../_widgets/faq";
import Contact from "../_widgets/contact";
import { Qoute } from "../globalTypes";

export default function Home() {
  const quotes: Qoute[] = [
    {
      userName: "اسم آژانس املاک",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote: "لورم ایپسوم  و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "سامان حاجی پور",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "اسم آژانس املاک",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "اسم آژانس املاک",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "سامان حاجی پور",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "اسم آژانس املاک",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "اسم آژانس املاک",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
    {
      userName: "سامان حاجی پور",
      subtitle: "۱۴۰۱/۱۲/۱۲",
      userQuote:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
    },
  ];

  return (
    <Fragment>
      <Header />
      <MostVisitedCities />
      <WhyPstMelk />
      <QuoteFromUsers title="نقل قول کاربران پست ملک" quotes={quotes} />
      <Pocket />
      <SuggestedPages />
      <Strongest />
      <FAQ />
      <Contact />
    </Fragment>
  );
}
