import SwiperComponent from "@/app/_components/swiper";
import React from "react";
import "./index.css";
import Image from "next/image";
import Microphone from "/public/images/mic.svg";

interface Qoute {
  userName: string;
  userQuote: string;
  registeryDate: string;
}

const quotes: Qoute[] = [
  {
    userName: "اسم آژانس املاک",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote: "لورم ایپسوم  و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "سامان حاجی پور",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "اسم آژانس املاک",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "اسم آژانس املاک",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "سامان حاجی پور",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "اسم آژانس املاک",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "اسم آژانس املاک",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
  {
    userName: "سامان حاجی پور",
    registeryDate: "۱۴۰۱/۱۲/۱۲",
    userQuote:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و",
  },
];

export default function QuoteFromUsers() {
  return (
    <section className="my-12 mx-4">
      <div className="flex flex-col items-center">
        <Image src={Microphone} alt="icon" />
        <h3 className="font-bold text-2xl text-gray4 mt-4 mb-7">
          نقل قول کاربران پست ملک
        </h3>
      </div>
      <SwiperComponent
        slides={quotes.map((quote, index) => (
          <div key={index}>
            <div className="swiperComponentHeader text-center flex flex-col">
              <h3 className="font-bold text-center text-2xl">
                {quote.userName}
              </h3>
              <span className="mb-6 mt-2">{quote.registeryDate}</span>
            </div>
            <div>{quote.userQuote}</div>
          </div>
        ))}
      />
    </section>
  );
}
